In [2]:
import pandas as pd
from datetime import datetime
students_data = [
    {'roll_no': 1, 'name': 'Alice', 'father': 'Bob', 'course': 'Physics', 'date_of_admission': '2023-01-10', 'fee': 10000},
    {'roll_no': 2, 'name': 'Brian', 'father': 'Steve', 'course': 'Chemistry', 'date_of_admission': '2023-02-12', 'fee': 11000},
    {'roll_no': 3, 'name': 'Chloe', 'father': 'Tim', 'course': 'Biology', 'date_of_admission': '2023-03-14', 'fee': 12000},
    {'roll_no': 4, 'name': 'David', 'father': 'Rick', 'course': 'Mathematics', 'date_of_admission': '2023-04-10', 'fee': 13000},
    {'roll_no': 5, 'name': 'Eva', 'father': 'John', 'course': 'Computer Science', 'date_of_admission': '2023-05-16', 'fee': 14000},
    {'roll_no': 6, 'name': 'Frank', 'father': 'Tom', 'course': 'Economics', 'date_of_admission': '2023-06-21', 'fee': 15000},
    {'roll_no': 7, 'name': 'Grace', 'father': 'Harry', 'course': 'History', 'date_of_admission': '2023-07-25', 'fee': 16000},
    {'roll_no': 8, 'name': 'Henry', 'father': 'Charles', 'course': 'Geography', 'date_of_admission': '2023-08-17', 'fee': 17000},
    {'roll_no': 9, 'name': 'Isabel', 'father': 'Oliver', 'course': 'English', 'date_of_admission': '2023-09-10', 'fee': 18000},
    {'roll_no': 10, 'name': 'Jack', 'father': 'Noah', 'course': 'Art', 'date_of_admission': '2023-10-05', 'fee': 19000},
]
df: pd.DataFrame = pd.DataFrame(students_data)
df['date_of_admission'] = pd.to_datetime(df['date_of_admission'])
df[['name', 'fee']]

     name    fee
0   Alice  10000
1   Brian  11000
2   Chloe  12000
3   David  13000
4     Eva  14000
5   Frank  15000
6   Grace  16000
7   Henry  17000
8  Isabel  18000
9    Jack  19000

In [3]:
df

   roll_no    name   father            course date_of_admission    fee
0        1   Alice      Bob           Physics        2023-01-10  10000
1        2   Brian    Steve         Chemistry        2023-02-12  11000
2        3   Chloe      Tim           Biology        2023-03-14  12000
3        4   David     Rick       Mathematics        2023-04-10  13000
4        5     Eva     John  Computer Science        2023-05-16  14000
5        6   Frank      Tom         Economics        2023-06-21  15000
6        7   Grace    Harry           History        2023-07-25  16000
7        8   Henry  Charles         Geography        2023-08-17  17000
8        9  Isabel   Oliver           English        2023-09-10  18000
9       10    Jack     Noah               Art        2023-10-05  19000

In [4]:
df.course.value_counts(dropna= False, normalize=True)

course
Physics             0.1
Chemistry           0.1
Biology             0.1
Mathematics         0.1
Computer Science    0.1
Economics           0.1
History             0.1
Geography           0.1
English             0.1
Art                 0.1
Name: proportion, dtype: float64

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   roll_no            10 non-null     int64
 1   name               10 non-null     object
 2   father             10 non-null     object
 3   course             10 non-null     object
 4   date_of_admission  10 non-null     datetime64[ns]
 5   fee                10 non-null     int64
dtypes: datetime64[ns](1), int64(2), object(3)
memory usage: 612.0+ bytes

In [6]:
df['roll_no']

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
Name: roll_no, dtype: int64

In [7]:
df1 : pd.DataFrame = pd.DataFrame(df[['roll_no', 'name']])
df2=df[df['course'] == "Physics"]
df

   roll_no    name   father            course date_of_admission    fee
0        1   Alice      Bob           Physics        2023-01-10  10000
1        2   Brian    Steve         Chemistry        2023-02-12  11000
2        3   Chloe      Tim           Biology        2023-03-14  12000
3        4   David     Rick       Mathematics        2023-04-10  13000
4        5     Eva     John  Computer Science        2023-05-16  14000
5        6   Frank      Tom         Economics        2023-06-21  15000
6        7   Grace    Harry           History        2023-07-25  16000
7        8   Henry  Charles         Geography        2023-08-17  17000
8        9  Isabel   Oliver           English        2023-09-10  18000
9       10    Jack     Noah               Art        2023-10-05  19000

In [8]:
df[df['course'].str.endswith('s')].info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 0 to 5
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   roll_no            3 non-null      int64
 1   name               3 non-null      object
 2   father             3 non-null      object
 3   course             3 non-null      object
 4   date_of_admission  3 non-null      datetime64[ns]
 5   fee                3 non-null      int64
dtypes: datetime64[ns](1), int64(2), object(3)
memory usage: 168.0+ bytes

In [9]:
df[df['course'].str.contains('cs') | df['course'].str.contains('r')]

   roll_no   name   father            course date_of_admission    fee
0        1  Alice      Bob           Physics        2023-01-10  10000
1        2  Brian    Steve         Chemistry        2023-02-12  11000
3        4  David     Rick       Mathematics        2023-04-10  13000
4        5    Eva     John  Computer Science        2023-05-16  14000
5        6  Frank      Tom         Economics        2023-06-21  15000
6        7  Grace    Harry           History        2023-07-25  16000
7        8  Henry  Charles         Geography        2023-08-17  17000
9       10   Jack     Noah               Art        2023-10-05  19000

In [10]:
df

   roll_no    name   father            course date_of_admission    fee
0        1   Alice      Bob           Physics        2023-01-10  10000
1        2   Brian    Steve         Chemistry        2023-02-12  11000
2        3   Chloe      Tim           Biology        2023-03-14  12000
3        4   David     Rick       Mathematics        2023-04-10  13000
4        5     Eva     John  Computer Science        2023-05-16  14000
5        6   Frank      Tom         Economics        2023-06-21  15000
6        7   Grace    Harry           History        2023-07-25  16000
7        8   Henry  Charles         Geography        2023-08-17  17000
8        9  Isabel   Oliver           English        2023-09-10  18000
9       10    Jack     Noah               Art        2023-10-05  19000

In [11]:


for group in list(df.groupby(['course'])):
    print (group[0])
    print(group[1])

('Art',)
   roll_no  name father course date_of_admission    fee
9       10  Jack   Noah    Art        2023-10-05  19000
('Biology',)
   roll_no   name father   course date_of_admission    fee
2        3  Chloe    Tim  Biology        2023-03-14  12000
('Chemistry',)
   roll_no   name father     course date_of_admission    fee
1        2  Brian  Steve  Chemistry        2023-02-12  11000
('Computer Science',)
   roll_no name father            course date_of_admission    fee
4        5  Eva   John  Computer Science        2023-05-16  14000
('Economics',)
   roll_no   name father     course date_of_admission    fee
5        6  Frank    Tom  Economics        2023-06-21  15000
('English',)
   roll_no    name  father   course date_of_admission    fee
8        9  Isabel  Oliver  English        2023-09-10  18000
('Geography',)
   roll_no   name   father     course date_of_admission    fee
7        8  Henry  Charles  Geography        2023-08-17  17000
('History',)
   roll_no   name father   course date_of_admission    fee
6        7  Grace  Harry  History        2023-07-25  16000
('Mathematics',)
   roll_no   name father       course date_of_admission    fee
3        4  David   Rick  Mathematics        2023-04-10  13000
('Physics',)
   roll_no   name father   course date_of_admission    fee
0        1  Alice    Bob  Physics        2023-01-10  10000

In [12]:
df

   roll_no    name   father            course date_of_admission    fee
0        1   Alice      Bob           Physics        2023-01-10  10000
1        2   Brian    Steve         Chemistry        2023-02-12  11000
2        3   Chloe      Tim           Biology        2023-03-14  12000
3        4   David     Rick       Mathematics        2023-04-10  13000
4        5     Eva     John  Computer Science        2023-05-16  14000
5        6   Frank      Tom         Economics        2023-06-21  15000
6        7   Grace    Harry           History        2023-07-25  16000
7        8   Henry  Charles         Geography        2023-08-17  17000
8        9  Isabel   Oliver           English        2023-09-10  18000
9       10    Jack     Noah               Art        2023-10-05  19000

In [16]:
for group in df.groupby(['course']):
    display(group[0])
    display(group[1].name)

('Art',)

9    Jack
Name: name, dtype: object

('Biology',)

2    Chloe
Name: name, dtype: object

('Chemistry',)

1    Brian
Name: name, dtype: object

('Computer Science',)

4    Eva
Name: name, dtype: object

('Economics',)

5    Frank
Name: name, dtype: object

('English',)

8    Isabel
Name: name, dtype: object

('Geography',)

7    Henry
Name: name, dtype: object

('History',)

6    Grace
Name: name, dtype: object

('Mathematics',)

3    David
Name: name, dtype: object

('Physics',)

0    Alice
Name: name, dtype: object